# 이스케이프 문자
# 이스케이프 문자는 '\'로 시작함
# 이스케이프 문자          설명
#---------------------------------------------------
#      \n                  줄 바꾸기
#      \t                  탭
#      \\                  '\' 기호
#      \'                   ' 기호
#      \"                   " 기호
print('나는 파이썬을 사랑합니다.\n파이썬은 자바보다 훨씬 쉽습니다.')
print('Name: John Smith\tSex: Male\tAge: 22')
print('이 문장은 화면폭에 비해 너무 길어 보기가 힘듭니다. \
그래서 \\Enter키를 이용해 문장을 다음줄과 연속되도록 했습니다.')
print('작은따옴표(\')와 큰 따옴표(")는 문자열을 정의할 때 사용합니다.')

print('python')
print('\'python\'')
print('"python"')
print("'python'")
